# Data processing: Pandas

* Python library for data manipulation and analysis
* high-performance and efficient
* easy to use
* to handle structured data
* perform operations like: filtering, grouping, aggregation
* data visualization

Often used in fields as:
* data science
* machine learning
* data analysis




---------------------------------------------------------

First, **install** pandas using:
    pip install pandas

**Import pandas**

In [1]:
import pandas as pd  #pd commonly used abbreviation

## Pandas Series

* A one-dimensional array-like object
* Can hold data of any type (integer, float, string, etc.)
* Labelled data, each element has an index. 
* Can be created from lists, arrays, dictionaries, and existing Series objects
* Building block for the Pandas DataFrame
* Like a column in a spreadsheet, a single column of a database table
* The length of a Series cannot be changed (but values can be changed and columns can be inserted into DataFrames)


--> The vast majority of Pandas methods produce new objects, leaving the input data untouched. 
* Immutability is favored where sensible

### Creating a Pandas Series from a list

In [2]:
data = ["Mickey", "Minnie", "Pluto", "Donald Duck"]
series_from_list = pd.Series(data)
series_from_list

0         Mickey
1         Minnie
2          Pluto
3    Donald Duck
dtype: object

If no index labels are specified, they are labeled with their index numbers (starting from 0)

### Creating a Pandas Series from a dictionary

In [3]:
data = {"a": 1, "b": 2, "c": 3, "d":4}
series_from_dict = pd.Series(data)
series_from_dict

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
my_series = pd.Series({'London':10, 'Tripoli':100, 'Cairo':10})

* Index labels: 'London', 'Tripoli', 'Cairo'
* Values of the Series: 10, 100, 10

In [5]:
# Displaying the Series
my_series

London      10
Tripoli    100
Cairo       10
dtype: int64

### Creating a Series with a custom index

In [6]:
data = ["Pooh", "Winnie", "Kanga", "Roo"]
index = ["Participant1", "Participant2", "Participant3", "Participant4"]
series_custom_index = pd.Series(data, index=index)
print(series_custom_index)

Participant1      Pooh
Participant2    Winnie
Participant3     Kanga
Participant4       Roo
dtype: object

In [7]:
#Creating a Series using only the data from a dict with the keys "London" and "Cairo"
lc_series = pd.Series(my_series, index=["London", "Cairo"])
lc_series

London    10
Cairo     10
dtype: int64

### Accessing and manipulating data using the index label

In [8]:
# Accessing a specific element in the Series using the index label
my_series['Tripoli']

100

In [9]:
print(series_from_list[0])
print(series_from_dict["b"])

Mickey
2

In [10]:
# Filtering elements based on a condition
my_series[my_series > 10]

Tripoli    100
dtype: int64

### Attributes
A Series object has several attributes: index, values, dtype, shape, ndim, size, name...

In [11]:
#Let's play around

Checkout the [API reference](https://pandas.pydata.org/docs/reference/series.html#constructor) for more functionality.

## Pandas DataFrame

* Two-dimensional labeled data structure
* Like a spreadsheet or table
* Three main components
    - the data: stored in rows and columns
    - the rows: labeled by an index
    - the columns: labeled and contain the actual data
* Flexible indexing
* Acces to rows, columns or individual elements based on labels or integer positions
* Size can be changed

### Creating a DataFrame from a dictionary

In [13]:
# Sample data (dict) for DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
    'Age': [25, 30, 35, 28, 32],
    'City': ['London', 'New York', 'Paris', 'Tokyo', 'Sydney'],
    'Salary': [60000, 75000, 80000, 70000, 65000]
}

In [14]:
# Creating a DataFrame
df = pd.DataFrame(data)

# Displaying the DataFrame
df

      Name  Age      City  Salary
0    Alice   25    London   60000
1      Bob   30  New York   75000
2  Charlie   35     Paris   80000
3    David   28     Tokyo   70000
4     Emma   32    Sydney   65000

### Creating a DataFrame from a list of lists

In [15]:
data = [['John', 25, 'New York'],
        ['Alice', 30, 'Los Angeles'],
        ['Bob', 35, 'Chicago']]
columns = ['Name', 'Age', 'City']
df2 = pd.DataFrame(data, columns=columns)
df2

    Name  Age         City
0   John   25     New York
1  Alice   30  Los Angeles
2    Bob   35      Chicago

### Indexing

##### Accessing a column

In [16]:
# Accessing a column
print(df['Name'])

0      Alice
1        Bob
2    Charlie
3      David
4       Emma
Name: Name, dtype: object

##### Accesing a row by label

In [17]:
 # Accessing a row by label
print(df.loc[0])

Name       Alice
Age           25
City      London
Salary     60000
Name: 0, dtype: object

##### Accessing a row by integer position

In [18]:
 # Accessing a row by integer position
print(df.iloc[0])

Name       Alice
Age           25
City      London
Salary     60000
Name: 0, dtype: object

##### Accessing an individual element

In [19]:
# Accessing an individual element
print(df.at[3, 'Name'])

David

### Slicing

##### Index labels: loc

In [20]:
# Using index labels for rows and columns: loc

df.loc[1:3, 'Name':'City']

      Name  Age      City
1      Bob   30  New York
2  Charlie   35     Paris
3    David   28     Tokyo

##### Integer positions: iloc

In [21]:
# Using integer positions for rows and columns: iloc
df.iloc[1:3, 0:3]

      Name  Age      City
1      Bob   30  New York
2  Charlie   35     Paris

***Beware! Labels vs indexing!***

In [22]:
print("df")
print(df)
print("Labels")
print(df.loc[1:3]) #labels
print("Integer positions")
print(df.iloc[1:3]) #integer positions

df
      Name  Age      City  Salary
0    Alice   25    London   60000
1      Bob   30  New York   75000
2  Charlie   35     Paris   80000
3    David   28     Tokyo   70000
4     Emma   32    Sydney   65000
Labels
      Name  Age      City  Salary
1      Bob   30  New York   75000
2  Charlie   35     Paris   80000
3    David   28     Tokyo   70000
Integer positions
      Name  Age      City  Salary
1      Bob   30  New York   75000
2  Charlie   35     Paris   80000

### Column operations

##### Adding a new column

In [23]:
# Adding a new column
df['Experience'] = [3, 5, 7, 4, 6]
df

      Name  Age      City  Salary  Experience
0    Alice   25    London   60000           3
1      Bob   30  New York   75000           5
2  Charlie   35     Paris   80000           7
3    David   28     Tokyo   70000           4
4     Emma   32    Sydney   65000           6

##### Boolean indexing

In [24]:
# Filtering rows based on a condition (boolean indexing)
high_salary_employees = df[df['Salary'] > 70000]
print(high_salary_employees)

      Name  Age      City  Salary  Experience
1      Bob   30  New York   75000           5
2  Charlie   35     Paris   80000           7

##### Sorting by column

In [32]:
# Sorting DataFrame by a column
sorted_df = df.sort_values(by='Age', ascending=False)
print(sorted_df)

      Name  Age      City   Salary  Experience
2  Charlie   35     Paris  80000.0           7
4     Emma   32    Sydney  65000.0           6
1      Bob   30  New York  75000.0           5
3    David   28     Tokyo  70000.0           4
0    Alice   25    London  60000.0           3
5       Mo   23    Leuven      NaN           1

### Missing Data Handling

In [26]:
#Add a row with missing data
import numpy as np
new_row = {"Name": "Mo", "Age": 23, "City": "Leuven", "Salary": np.nan, "Experience": 1}
df.loc[len(df)] = new_row
df

      Name  Age      City   Salary  Experience
0    Alice   25    London  60000.0           3
1      Bob   30  New York  75000.0           5
2  Charlie   35     Paris  80000.0           7
3    David   28     Tokyo  70000.0           4
4     Emma   32    Sydney  65000.0           6
5       Mo   23    Leuven      NaN           1

In [27]:
# Dropping rows with missing values
df.dropna()
df

      Name  Age      City   Salary  Experience
0    Alice   25    London  60000.0           3
1      Bob   30  New York  75000.0           5
2  Charlie   35     Paris  80000.0           7
3    David   28     Tokyo  70000.0           4
4     Emma   32    Sydney  65000.0           6
5       Mo   23    Leuven      NaN           1

In [28]:
# Dropping rows with missing values
k = df.dropna()
k

      Name  Age      City   Salary  Experience
0    Alice   25    London  60000.0           3
1      Bob   30  New York  75000.0           5
2  Charlie   35     Paris  80000.0           7
3    David   28     Tokyo  70000.0           4
4     Emma   32    Sydney  65000.0           6

In [ ]:
# Filling missing values with a specified value
p = df.fillna(0)
p

### Grouping and aggregation

In [29]:
# Grouping by a column and calculating mean
avg_age_by_city = df.groupby('City')['Age'].mean()
avg_age_by_city

City
Leuven      23.0
London      25.0
New York    30.0
Paris       35.0
Sydney      32.0
Tokyo       28.0
Name: Age, dtype: float64

### Attributes and underlying data
A DataFrame object has several attributes: index, columns, values, dtypes, axes, ndim, size,shape, empty, head, tail...

In [30]:
#Let's play around
df.shape

(6, 5)

Use ***info()*** method to display information about the DataFrame

In [ ]:
df.info()

The ***describe()*** method generates summary statistics (count, mean, std, min, 25%, 50%, 75%, max) for numeric columns in the DataFrame

In [ ]:
df.describe()  #p

### Operations

In [ ]:
# Sample data
data = {
    'A': [1, 2, 3, 4, 5],
    'B': [5, 4, 3, 2, 1],
    'C': [10, 20, 30, 40, 50]
}

df = pd.DataFrame(data)
df

#### Arithmetic operations

In [ ]:
# Addition
print(df['A'] + df['B'])  # Adds columns A and B element-wise

In [ ]:
# Subtraction
print(df['C'] - df['B'])  # Subtracts column B from column C element-wise

In [ ]:
df

In [ ]:
# Multiplication
print(df['A'] * df['C'])  # Multiplies columns A and C element-wise

In [ ]:
# Division
print(df['C'] / df['A'])  # Divides column C by column A element-wise

#### Statistical aggregations

In [ ]:
# Mean
print(df.mean())  # Calculates the mean of each column

In [ ]:
# Median
print(df.median())  # Calculates the median of each column

#### Merging and joining DataFrames

In [ ]:
# Concatenating along columns
df_concat = pd.concat([df, df], axis=1)  # Concatenates the DataFrame with itself along columns
df_concat

In [ ]:
# Concatenating along rows
df_concat = pd.concat([df, df], axis=0)  # Concatenates the DataFrame with itself along columns
df_concat

### Creating a dataframe from data in a CSV

In [ ]:
df = pd.read_csv('data.csv')